#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.main will be created
  + resource "aws_ecr_repository" "main" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "checkpoint-task/counter-service"
      + region               = "eu-west-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Environment" = "checkpoint-task"
          + "Terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "checkpoint-task"
          + "Terraform"   = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_ecr_repository_policy.main will be created
  + resource "aws_ecr_repository_policy" "main" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:DescribeRepositories",
                          + "ecr:ListImages",
                          + "ecr:DescribeImages",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::685368365575:role/checkpoint-task-eks-cluster-20251112082428118900000001",
                              + "arn:aws:iam::685368365575:role/main-eks-node-group-20251112082442773800000006",
                            ]
                        }
                      + Sid       = "AllowEKSPull"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region      = "eu-west-1"
      + registry_id = (known after apply)
      + repository  = "checkpoint-task/counter-service"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - private_subnets_count    = 2 -> null

```

</details>

*Pusher: @codeidog, Action: `pull_request`, PR: #13*